app/controllers/arrived_products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "arrived_products".* FROM "arrived_products"
UPDATE "products" SET "count" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["count", 120], ["updated_at", "2020-12-27 23:16:51.131969"], ["id", 3]]
INSERT INTO "arrived_products" ("product_id", "count", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 3], ["count", 20], ["created_at", "2020-12-27 23:16:51.141849"], ["updated_at", "2020-12-27 23:16:51.141849"]]
---
  def create
    item = ArrivedProduct.new(permit_params)
    product = Product.find(item.product.id)
    product.update(count: product.count.to_f + item.count.to_f)
    if item.save
      render json: ArrivedProduct.all

SELECT "arrived_products".* FROM "arrived_products"
SELECT "products".* FROM "products"
---
  def index
    render json: ArrivedProduct.all