app/controllers/products_controller.rb

INSERT INTO "products" ("name", "annotation", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Ингалипт"], ["annotation", "-"], ["price", 4.5], ["created_at", "2020-12-27 23:17:59.920361"], ["updated_at", "2020-12-27 23:17:59.920361"]]
SELECT "products".* FROM "products"
---
  def create
    item = Product.new(permit_params)
    if item.save
      render json: Product.all

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    Product.find(params[:id]).destroy

SELECT "products".* FROM "products"
---
  def index
    render json: Product.all