app/controllers/sales_controller.rb

  def create
    item = Sale.new(permit_params)
    product = Product.find(item.product.id)
    item.cost = item.count.to_f * product.price.to_f
    product.update(count: product.count.to_f - item.count.to_f)
    if item.save
      render json: Sale.all
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "sales".* FROM "sales"
UPDATE "products" SET "count" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["count", 98], ["updated_at", "2020-12-27 21:51:30.275264"], ["id", 2]]
INSERT INTO "sales" ("product_id", "count", "cost", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["product_id", 2], ["count", 2], ["cost", 3.0], ["created_at", "2020-12-27 21:51:30.564854"], ["updated_at", "2020-12-27 21:51:30.564854"]]

  def index
    render json: Sale.all
---
SELECT "sales".* FROM "sales"